[
  {
    "date": "2025-12-13",
    "day": 1,
    "city": "Milan",
    "country": "Italy",
    "hotel": "IQ Hotel Milano",
    "theme": "Duomo & shopping",
    "plan": "Arrive Milan, visit Duomo, Duomo Museum and rooftop, Galleria Vittorio Emanuele II and Rinascente; explore nearby streets and Christmas market.",
    "transportTip": "Use ATM metro (Duomo / Cordusio). A 24h ticket is convenient if you ride more than twice.",
    "foodTip": "Look for risotto alla milanese, ossobuco and aperitivo near Duomo or Brera.",
    "mustDo": "Go onto the Duomo rooftop for sunset, walk through the Galleria and see the Christmas tree.",
    "mustBuy": "Panettone, truffle chocolates, Italian fashion or leather accessories.",
    "weather": "Typical mid-December Milan: around 0–8°C, often cloudy or foggy, cold at night."
  },
  {
    "date": "2025-12-14",
    "day": 2,
    "city": "Milan",
    "country": "Italy",
    "hotel": "IQ Hotel Milano",
    "theme": "Football & Last Supper",
    "plan": "San Siro stadium match or tour; visit Santa Maria delle Grazie to see The Last Supper (pre-booked slot).",
    "transportTip": "Take metro M5 to San Siro; book Last Supper entry well in advance and arrive 15–20 mins early.",
    "foodTip": "Try cotoletta alla milanese and a local trattoria dinner near Cadorna or Brera.",
    "mustDo": "Photo at San Siro, quiet walk around the church after seeing The Last Supper.",
    "mustBuy": "Club merchandise (AC Milan / Inter), small religious souvenirs near the church.",
    "weather": "Similar to Day 1: cold, 0–8°C, bring warm coat, scarf and gloves."
  },
  {
    "date": "2025-12-15",
    "day": 3,
    "city": "Lake Como (day trip)",
    "country": "Italy",
    "hotel": "IQ Hotel Milano",
    "theme": "Lake views",
    "plan": "Train from Milano Centrale to Varenna-Esino, ferry to Bellagio and Varenna old town; stroll lakeside and return by evening.",
    "transportTip": "Take Trenord train to Varenna-Esino (sit on the left leaving Milan for best lake views) and use ferries between Varenna, Bellagio and Menaggio.",
    "foodTip": "Taste lake fish dishes and gelato in Bellagio; choose a café with lake view.",
    "mustDo": "Sunset or blue-hour photos over the lake, short walk up in Varenna for panoramic views.",
    "mustBuy": "Como silk products, local olive oil or wine in small shops.",
    "weather": "Lake Como: about 2–7°C, damp and colder by the water, can be foggy."
  },
  {
    "date": "2025-12-16",
    "day": 4,
    "city": "Venice",
    "country": "Italy",
    "hotel": "NH Venezia Santa Lucia",
    "theme": "Arrival & canals",
    "plan": "High-speed train from Milan to Venezia S. Lucia, check-in, explore Cannaregio and central Venice; evening dinner at Impronta.",
    "transportTip": "Use ACTV vaporetto (water bus); consider 24h pass if you will ride several times.",
    "foodTip": "Enjoy cicchetti (Venetian tapas) with spritz in bacari; dinner at Impronta if reserved.",
    "mustDo": "Sunset walk from Rialto Bridge towards St Mark’s Square and back at night when crowds are lower.",
    "mustBuy": "Small Murano glass items or handmade mask; avoid very cheap tourist stalls.",
    "weather": "Venice in mid-December is often 2–8°C, humid, with mist or light rain possible."
  },
  {
    "date": "2025-12-17",
    "day": 5,
    "city": "Florence",
    "country": "Italy",
    "hotel": "C-Hotel Diplomat Firenze",
    "theme": "Renaissance Florence",
    "plan": "Morning train from Venice to Florence; visit Mercato Centrale for food, Santa Maria Novella surroundings, Florence Cathedral area and Accademia or other museums.",
    "transportTip": "Florence is very walkable from S.M.Novella station; no need for public transport for central sights.",
    "foodTip": "Try bistecca alla fiorentina at a reputable trattoria (e.g. Dall’Oste or similar) and panini like All’antico Vinaio.",
    "mustDo": "Evening view of the Duomo and Piazza della Signoria; stroll across Ponte Vecchio if time.",
    "mustBuy": "Leather goods, handmade stationery, products from Officina Profumo-Farmaceutica di Santa Maria Novella.",
    "weather": "Florence: about 3–10°C; cool but often sunnier than northern Italy."
  },
  {
    "date": "2025-12-18",
    "day": 6,
    "city": "Florence & Pisa",
    "country": "Italy",
    "hotel": "C-Hotel Diplomat Firenze",
    "theme": "Pisa side trip",
    "plan": "Train to Pisa S. Rossore, walk to Piazza dei Miracoli to see Leaning Tower and cathedral, then back to Florence for afternoon/evening.",
    "transportTip": "Use regional train Florence–Pisa; from Pisa S. Rossore it is a short walk to the Leaning Tower complex.",
    "foodTip": "Enjoy casual lunch near Piazza dei Miracoli, then back in Florence have gelato and a simple trattoria dinner.",
    "mustDo": "Classic Leaning Tower photos and relaxed walk around Piazza dei Miracoli.",
    "mustBuy": "Small Pisa souvenirs or magnets; in Florence, more leather or local wine.",
    "weather": "Pisa/Florence: around 4–11°C, may be breezy near open spaces."
  },
  {
    "date": "2025-12-19",
    "day": 7,
    "city": "Rome",
    "country": "Italy",
    "hotel": "The Hive Hotel",
    "theme": "Ancient Rome",
    "plan": "Train to Rome; visit Colosseum, Roman Forum and Palatine Hill, then Piazza Venezia and nearby streets.",
    "transportTip": "Use metro B (Colosseo) and walk between ancient sites; buy a day pass if using metro/bus several times.",
    "foodTip": "Try carbonara or cacio e pepe at a good trattoria; avoid aggressive tourist menus right next to main sights.",
    "mustDo": "Golden-hour view of the Forum from above; night lights around the Vittoriano (Altare della Patria).",
    "mustBuy": "Postcards, history-themed books, or small replicas of ancient statues.",
    "weather": "Rome: typically 5–12°C, milder than northern Italy, occasional showers."
  },
  {
    "date": "2025-12-20",
    "day": 8,
    "city": "Rome",
    "country": "Italy",
    "hotel": "The Hive Hotel",
    "theme": "Vatican & Trastevere",
    "plan": "Morning Vatican Museums, Sistine Chapel, St Peter’s Basilica and dome if desired; afternoon and evening in Trastevere and Tiber Island.",
    "transportTip": "Use metro A (Ottaviano) or bus to Vatican; then walk across the river towards Trastevere.",
    "foodTip": "Eat near Vatican for lunch; in the evening, enjoy trattoria dinner in Trastevere with Roman specialties.",
    "mustDo": "Climb St Peter’s dome if weather is clear; night walk in Trastevere’s lanes and main square.",
    "mustBuy": "Rosary, Vatican stamps or religious souvenirs around the Basilica area.",
    "weather": "Similar to Day 7: 5–12°C, bring a light down jacket and umbrella."
  },
  {
    "date": "2025-12-21",
    "day": 9,
    "city": "Rome",
    "country": "Italy",
    "hotel": "The Hive Hotel",
    "theme": "Squares & fountains",
    "plan": "Navona Square Christmas market, Pantheon exterior/interior, Trevi Fountain, Spanish Steps and shopping streets.",
    "transportTip": "Mostly walking; you can use metro A (Spagna) for Spanish Steps and then walk back.",
    "foodTip": "Try maritozzo with cream from a good pasticceria and gelato near Pantheon.",
    "mustDo": "Throw a coin in Trevi Fountain, sunset at Spanish Steps if weather allows.",
    "mustBuy": "Italian fashion on Via del Corso or Via dei Condotti, plus sweets like biscotti.",
    "weather": "Cool but pleasant if sunny, around 6–12°C."
  },
  {
    "date": "2025-12-22",
    "day": 10,
    "city": "Paris",
    "country": "France",
    "hotel": "Mercure Paris Centre Gare Montparnasse",
    "theme": "Arrival & Left Bank",
    "plan": "Flight Rome to Paris Orly, transfer to Montparnasse; light exploration nearby (Montparnasse streets, café, evening stroll).",
    "transportTip": "Use OrlyBus or OrlyVal + RER/metro to reach Montparnasse; then rely on metro and walking.",
    "foodTip": "Start with a simple brasserie dinner: onion soup, steak-frites or confit de canard.",
    "mustDo": "Short evening walk around Montparnasse and first view of Paris Christmas lights.",
    "mustBuy": "French pastries or a baguette sandwich from a nearby bakery.",
    "weather": "Paris mid-December: around 2–8°C, often cloudy with chance of light rain."
  },
  {
    "date": "2025-12-23",
    "day": 11,
    "city": "Paris",
    "country": "France",
    "hotel": "Mercure Paris Centre Gare Montparnasse",
    "theme": "Historic islands & museums",
    "plan": "Sainte-Chapelle, Conciergerie, Louvre visit, Musée de l’Armée / Invalides and Seine stroll.",
    "transportTip": "Use metro lines 4/1 for Cité and Louvre; line 8 for Invalides; walking between river sights is pleasant.",
    "foodTip": "Lunch near Île de la Cité or Louvre (croque-monsieur, quiche), dinner near Invalides or Saint-Germain.",
    "mustDo": "See stained glass in Sainte-Chapelle and evening view of the Seine near Pont Alexandre III.",
    "mustBuy": "Small art prints or Louvre-themed souvenirs; chocolate from a Parisian chocolatier.",
    "weather": "Cool and damp, similar 2–8°C; gets dark around 17:00, perfect for lights on the bridges."
  },
  {
    "date": "2025-12-24",
    "day": 12,
    "city": "Paris",
    "country": "France",
    "hotel": "Mercure Paris Centre Gare Montparnasse",
    "theme": "Louvre & Versailles",
    "plan": "Morning Louvre deep visit, afternoon trip to Château de Versailles and Grand Trianon; evening Seine stroll.",
    "transportTip": "Metro line 1 to Louvre; then RER C from central Paris (e.g. Invalides) to Versailles-Château-Rive Gauche.",
    "foodTip": "Have lunch around Tuileries; at Versailles try a simple brasserie or grab-and-go in the town.",
    "mustDo": "Hall of Mirrors in Versailles and Louvre’s Denon wing highlights.",
    "mustBuy": "Versailles-themed souvenirs or books, plus French skincare from Paris pharmacies.",
    "weather": "2–7°C, colder in Versailles gardens with wind; dress warmly and wear good shoes."
  },
  {
    "date": "2025-12-25",
    "day": 13,
    "city": "Paris",
    "country": "France",
    "hotel": "Mercure Paris Centre Gare Montparnasse",
    "theme": "Eiffel area & Champs-Élysées",
    "plan": "Invalides/Napoleon’s tomb, walk along the Seine to Champ de Mars and Eiffel Tower, dinner near Champs-Élysées and Christmas lights plus Arc de Triomphe.",
    "transportTip": "Use metro lines 8 and 6, and walk between Invalides, Pont Alexandre III, and Eiffel Tower.",
    "foodTip": "Christmas dinner at a brasserie or restaurant near Champs-Élysées; book ahead as it is busy.",
    "mustDo": "Watch Eiffel Tower lights at dusk, then see Champs-Élysées Christmas decorations.",
    "mustBuy": "Macarons, Eiffel Tower souvenirs, or small luxury items from the avenue.",
    "weather": "Often cold and crisp: about 2–6°C; may feel extra chilly at night."
  },
  {
    "date": "2025-12-26",
    "day": 14,
    "city": "Paris to London",
    "country": "France / UK",
    "hotel": "Point A (London)",
    "theme": "Last Paris morning & Eurostar",
    "plan": "Last Paris activities or shopping in the morning, then Eurostar from Gare du Nord to London St Pancras in the afternoon.",
    "transportTip": "Use metro to Gare du Nord; in London start using Underground or bus with contactless card.",
    "foodTip": "Final Paris pastries in the morning; in London, try a pub dinner near your hotel or around the South Bank.",
    "mustDo": "Quick final walk in Paris (maybe Tuileries or along the Seine) before the train.",
    "mustBuy": "Last-minute French souvenirs (chocolate, wine, macarons) before entering UK customs rules.",
    "weather": "Paris morning: similar to previous days. London evening: about 3–9°C, often cloudy or drizzly."
  },
  {
    "date": "2025-12-27",
    "day": 15,
    "city": "London",
    "country": "United Kingdom",
    "hotel": "Point A",
    "theme": "London highlights & markets",
    "plan": "Explore Southbank Centre Winter Market, London Bridge area, and Covent Garden; evening by the Thames if time before departure next day.",
    "transportTip": "Use Tube and buses with contactless payment; central London is walkable between some key areas.",
    "foodTip": "Have fish & chips, a Sunday-style roast if available, or market street food by the river.",
    "mustDo": "Night view of the Thames and London Eye lit up, plus Covent Garden Christmas decorations.",
    "mustBuy": "English tea, biscuits, or souvenirs like football items or Harry Potter gifts.",
    "weather": "London mid-December: around 3–9°C, frequent clouds, light rain possible; feels colder in the wind."
  }
]
